# Lab | advanced-sql

## Load extensions

In [1]:
%load_ext sql

## Connect to the database

In [2]:
# Search for the database

In [3]:
%sql sqlite:///../../20-lab-sql-select/publications.db

## Get list of tables

In [4]:
%config SqlMagic.style = 'ALL'

In [5]:
# List of tables

In [6]:
%%sql
select * 
from sqlite_master
where type='table'
order by name;

 * sqlite:///../../20-lab-sql-select/publications.db
Done.

[('table', 'authors', 'authors', 2, 'CREATE TABLE `authors` (\n  `au_id` varchar(11) NOT NULL\n,  `au_lname` varchar(40) NOT NULL\n,  `au_fname` varchar(20) NOT NULL\n,  `phone` char(12) ... (60 characters truncated) ... varchar(20) DEFAULT NULL\n,  `state` char(2) DEFAULT NULL\n,  `zip` char(5) DEFAULT NULL\n,  `contract` integer NOT NULL\n,  PRIMARY KEY (`au_id`)\n)'),
 ('table', 'discounts', 'discounts', 4, 'CREATE TABLE `discounts` (\n  `discounttype` varchar(40) NOT NULL\n,  `stor_id` char(4) DEFAULT NULL\n,  `lowqty` integer DEFAULT NULL\n,  `highqty`  ... (37 characters truncated) ... ecimal(4,2) NOT NULL\n,  CONSTRAINT `discounts_ibfk_1` FOREIGN KEY (`stor_id`) REFERENCES `stores` (`stor_id`) ON DELETE CASCADE ON UPDATE CASCADE\n)'),
 ('table', 'employee', 'employee', 5, 'CREATE TABLE `employee` (\n  `emp_id` char(9) NOT NULL\n,  `fname` varchar(20) NOT NULL\n,  `minit` char(1) DEFAULT NULL\n,  `lname` varchar(30) NOT  ... (262 characters truncated) ... E ON UPDATE CASCADE\n,  CONSTRAINT `employee_ibfk_2` FOREIGN KEY (`pub_id`) REFERENCES `publishers` (`pub_id`) ON DELETE CASCADE ON UPDATE CASCADE\n)'),
 ('table', 'jobs', 'jobs', 7, 'CREATE TABLE `jobs` (\n  `job_id` integer NOT NULL\n,  `job_desc` varchar(50) NOT NULL\n,  `min_lvl` integer NOT NULL\n,  `max_lvl` integer NOT NULL\n,  PRIMARY KEY (`job_id`)\n)'),
 ('table', 'pub_info', 'pub_info', 8, 'CREATE TABLE `pub_info` (\n  `pub_id` char(4) NOT NULL\n,  `logo` longblob DEFAULT NULL\n,  `pr_info` longtext DEFAULT NULL\n,  PRIMARY KEY (`pub_id`)\n,  CONSTRAINT `pub_info_ibfk_1` FOREIGN KEY (`pub_id`) REFERENCES `publishers` (`pub_id`) ON DELETE CASCADE ON UPDATE CASCADE\n)'),
 ('table', 'publishers', 'publishers', 34, 'CREATE TABLE `publishers` (\n  `pub_id` char(4) NOT NULL\n,  `pub_name` varchar(40) DEFAULT NULL\n,  `city` varchar(20) DEFAULT NULL\n,  `state` char(2) DEFAULT NULL\n,  `country` varchar(30) DEFAULT NULL\n,  PRIMARY KEY (`pub_id`)\n)'),
 ('table', 'roysched', 'roysched', 36, 'CREATE TABLE `roysched` (\n  `title_id` varchar(6) NOT NULL\n,  `lorange` integer DEFAULT NULL\n,  `hirange` integer DEFAULT NULL\n,  `royalty` integer DEFAULT NULL\n,  CONSTRAINT `roysched_ibfk_1` FOREIGN KEY (`title_id`) REFERENCES `titles` (`title_id`) ON DELETE CASCADE ON UPDATE CASCADE\n)'),
 ('table', 'sales', 'sales', 37, 'CREATE TABLE `sales` (\n  `stor_id` char(4) NOT NULL\n,  `ord_num` varchar(20) NOT NULL\n,  `ord_date` datetime NOT NULL\n,  `qty` integer NOT NULL\n ... (218 characters truncated) ... CADE ON UPDATE CASCADE\n,  CONSTRAINT `sales_ibfk_2` FOREIGN KEY (`title_id`) REFERENCES `titles` (`title_id`) ON DELETE CASCADE ON UPDATE CASCADE\n)'),
 ('table', 'stores', 'stores', 39, 'CREATE TABLE `stores` (\n  `stor_id` char(4) NOT NULL\n,  `stor_name` varchar(40) DEFAULT NULL\n,  `stor_address` varchar(40) DEFAULT NULL\n,  `city` varchar(20) DEFAULT NULL\n,  `state` char(2) DEFAULT NULL\n,  `zip` char(5) DEFAULT NULL\n,  PRIMARY KEY (`stor_id`)\n)'),
 ('table', 'titleauthor', 'titleauthor', 41, 'CREATE TABLE `titleauthor` (\n  `au_id` varchar(11) NOT NULL\n,  `title_id` varchar(6) NOT NULL\n,  `au_ord` integer DEFAULT NULL\n,  `royaltyper` in ... (164 characters truncated) ... ADE ON UPDATE CASCADE\n,  CONSTRAINT `titleauthor_ibfk_2` FOREIGN KEY (`au_id`) REFERENCES `authors` (`au_id`) ON DELETE CASCADE ON UPDATE CASCADE\n)'),
 ('table', 'titles', 'titles', 45, 'CREATE TABLE `titles` (\n  `title_id` varchar(6) NOT NULL\n,  `title` varchar(80) NOT NULL\n,  `type` char(12) NOT NULL\n,  `pub_id` char(4) DEFAULT  ... (234 characters truncated) ... MARY KEY (`title_id`)\n,  CONSTRAINT `titles_ibfk_1` FOREIGN KEY (`pub_id`) REFERENCES `publishers` (`pub_id`) ON DELETE CASCADE ON UPDATE CASCADE\n)')]

![Image](https://github.com/ironhack-bcn-data-june-2020/20-lab-sql-select/blob/master/authors.png?raw=true)

## Challenge 1 - Most Profiting Authors

In [7]:
# Bonus 20

Who are the top 3 most profiting authors?

## Step 1: Calculate the royalties of each sales for each author

In [8]:
%%sql
select *
from authors
limit 3

 * sqlite:///../../20-lab-sql-select/publications.db
Done.

[('172-32-1176', 'White', 'Johnson', '408 496-7223', '10932 Bigge Rd.', 'Menlo Park', 'CA', '94025', 1),
 ('213-46-8915', 'Green', 'Marjorie', '415 986-7020', '309 63rd St. #411', 'Oakland', 'CA', '94618', 1),
 ('238-95-7766', 'Carson', 'Cheryl', '415 548-7723', '589 Darwin Ln.', 'Berkeley', 'CA', '94705', 1)]

In [9]:
%%sql
select *
from titles
limit 3

 * sqlite:///../../20-lab-sql-select/publications.db
Done.

[('BU1032', "The Busy Executive's Database Guide", 'business', '1389', 19.99, 5000, 10, 4095, 'An overview of available database systems with emphasis on common business applications. Illustrated.', '1991-06-12 00:00:00'),
 ('BU1111', 'Cooking with Computers: Surreptitious Balance Sheets', 'business', '1389', 11.95, 5000, 10, 3876, 'Helpful hints on how to use your electronic resources to the best advantage.', '1991-06-09 00:00:00'),
 ('BU2075', 'You Can Combat Computer Stress!', 'business', '0736', 2.99, 10125, 24, 18722, 'The latest medical and psychological techniques for living with the electronic office. Easy-to-understand explanations.', '1991-06-30 00:00:00')]

In [10]:
%%sql
select *
from titleauthor
limit 3

 * sqlite:///../../20-lab-sql-select/publications.db
Done.

[('172-32-1176', 'PS3333', 1, 100),
 ('213-46-8915', 'BU1032', 2, 40),
 ('213-46-8915', 'BU2075', 1, 100)]

In [11]:
%%sql
select *
from sales
limit 3

 * sqlite:///../../20-lab-sql-select/publications.db
Done.

[('6380', '6871', '1994-09-14 00:00:00', 5, 'Net 60', 'BU1032'),
 ('6380', '722a', '1994-09-13 00:00:00', 3, 'Net 60', 'PS2091'),
 ('7066', 'A2976', '1993-05-24 00:00:00', 50, 'Net 30', 'PC8888')]

Write a SELECT query to obtain the following output:

- Title ID
- Author ID
- Royalty of each sale for each autho

In [13]:
%%sql
select t.title_id as 'Title ID',
       t.title as 'Title',
       a.au_id as 'Author ID',
       round(t.price * s.qty * t.royalty / 100 * ta.royaltyper / 100,2) as 'Royalty'

from authors as a join titleauthor as ta on a.au_id = ta.au_id
                  join titles as t on ta.title_id = t.title_id
                  join sales as s on s.title_id = t.title_id
limit 3

 * sqlite:///../../20-lab-sql-select/publications.db
Done.

[('PS3333', 'Prolonged Data Deprivation: Four Case Studies', '172-32-1176', 29.99),
 ('BU1032', "The Busy Executive's Database Guide", '213-46-8915', 4.0),
 ('BU1032', "The Busy Executive's Database Guide", '213-46-8915', 8.0)]

## Step 2: Aggregate the total royalties for each title for each author

Using the output from Step 1, write a query to obtain the following output:

- Title ID
- Author ID
- Aggregated royalties of each title for each author

In [22]:
%%sql
select t.title_id as 'Title_ID',
       t.title as 'Title',
       a.au_id as 'Author_ID',
       round(sum(t.price * s.qty * t.royalty / 100 * ta.royaltyper / 100),2) as 'Total royalties'
      
from authors as a join titleauthor as ta on a.au_id = ta.au_id
                  join titles as t on ta.title_id = t.title_id
                  join sales as s on s.title_id = t.title_id

group by a.au_id, t.title_id
order by a.au_id

 * sqlite:///../../20-lab-sql-select/publications.db
Done.

[('PS3333', 'Prolonged Data Deprivation: Four Case Studies', '172-32-1176', 29.99),
 ('BU1032', "The Busy Executive's Database Guide", '213-46-8915', 11.99),
 ('BU2075', 'You Can Combat Computer Stress!', '213-46-8915', 25.12),
 ('PC1035', 'But Is It User Friendly?', '238-95-7766', 110.16),
 ('BU1111', 'Cooking with Computers: Surreptitious Balance Sheets', '267-41-2394', 11.95),
 ('TC7777', 'Sushi, Anyone?', '267-41-2394', 8.99),
 ('BU7832', 'Straight Talk About Computers', '274-80-9391', 29.99),
 ('BU1032', "The Busy Executive's Database Guide", '409-56-7008', 17.99),
 ('PC8888', 'Secrets of Silicon Valley', '427-17-2319', 50.0),
 ('TC7777', 'Sushi, Anyone?', '472-27-2349', 8.99),
 ('PS7777', 'Emotional Security: A New Algorithm', '486-29-1786', 19.98),
 ('TC4203', 'Fifty Years in Buckingham Palace Kitchens', '648-92-1872', 33.46),
 ('TC7777', 'Sushi, Anyone?', '672-71-3249', 11.99),
 ('MC2222', 'Silicon Valley Gastronomic Treats', '712-45-1867', 23.99),
 ('MC3021', 'The Gourmet Microwave', '722-51-5454', 21.53),
 ('BU1111', 'Cooking with Computers: Surreptitious Balance Sheets', '724-80-9391', 17.93),
 ('PS1372', 'Computer Phobic AND Non-Phobic Individuals: Behavior Variations', '724-80-9391', 10.8),
 ('PS1372', 'Computer Phobic AND Non-Phobic Individuals: Behavior Variations', '756-30-7391', 32.39),
 ('TC3218', 'Onions, Leeks, and Garlic: Cooking Secrets of the Mediterranean', '807-91-6654', 83.8),
 ('PC8888', 'Secrets of Silicon Valley', '846-92-7186', 50.0),
 ('MC3021', 'The Gourmet Microwave', '899-46-2035', 7.18),
 ('PS2091', 'Is Anger the Enemy?', '899-46-2035', 70.96),
 ('PS2091', 'Is Anger the Enemy?', '998-72-3567', 70.96),
 ('PS2106', 'Life Without Fear', '998-72-3567', 17.0)]

In [15]:
# Subquery?

In [16]:
%%sql
select Title_ID,
       Title,
       Author_ID,
       round(sum(subquery.Royalty),2) as 'Total_Royalties'
      
from (select t.title_id as 'Title_ID',
             t.title as 'Title',
             a.au_id as 'Author_ID',
             t.price * s.qty * t.royalty / 100 * ta.royaltyper / 100 as 'Royalty'
      
    from authors as a join titleauthor as ta on a.au_id = ta.au_id
                      join titles as t on ta.title_id = t.title_id
                      join sales as s on s.title_id = t.title_id
    ) as subquery

group by Author_ID, Title_ID
order by Author_ID

 * sqlite:///../../20-lab-sql-select/publications.db
Done.

[('PS3333', 'Prolonged Data Deprivation: Four Case Studies', '172-32-1176', 29.99),
 ('BU1032', "The Busy Executive's Database Guide", '213-46-8915', 11.99),
 ('BU2075', 'You Can Combat Computer Stress!', '213-46-8915', 25.12),
 ('PC1035', 'But Is It User Friendly?', '238-95-7766', 110.16),
 ('BU1111', 'Cooking with Computers: Surreptitious Balance Sheets', '267-41-2394', 11.95),
 ('TC7777', 'Sushi, Anyone?', '267-41-2394', 8.99),
 ('BU7832', 'Straight Talk About Computers', '274-80-9391', 29.99),
 ('BU1032', "The Busy Executive's Database Guide", '409-56-7008', 17.99),
 ('PC8888', 'Secrets of Silicon Valley', '427-17-2319', 50.0),
 ('TC7777', 'Sushi, Anyone?', '472-27-2349', 8.99),
 ('PS7777', 'Emotional Security: A New Algorithm', '486-29-1786', 19.98),
 ('TC4203', 'Fifty Years in Buckingham Palace Kitchens', '648-92-1872', 33.46),
 ('TC7777', 'Sushi, Anyone?', '672-71-3249', 11.99),
 ('MC2222', 'Silicon Valley Gastronomic Treats', '712-45-1867', 23.99),
 ('MC3021', 'The Gourmet Microwave', '722-51-5454', 21.53),
 ('BU1111', 'Cooking with Computers: Surreptitious Balance Sheets', '724-80-9391', 17.93),
 ('PS1372', 'Computer Phobic AND Non-Phobic Individuals: Behavior Variations', '724-80-9391', 10.8),
 ('PS1372', 'Computer Phobic AND Non-Phobic Individuals: Behavior Variations', '756-30-7391', 32.39),
 ('TC3218', 'Onions, Leeks, and Garlic: Cooking Secrets of the Mediterranean', '807-91-6654', 83.8),
 ('PC8888', 'Secrets of Silicon Valley', '846-92-7186', 50.0),
 ('MC3021', 'The Gourmet Microwave', '899-46-2035', 7.18),
 ('PS2091', 'Is Anger the Enemy?', '899-46-2035', 70.96),
 ('PS2091', 'Is Anger the Enemy?', '998-72-3567', 70.96),
 ('PS2106', 'Life Without Fear', '998-72-3567', 17.0)]

## Step 3: Calculate the total profits of each author

Using the output from Step 2, write a query to obtain the following output:

- Author ID
- Profits of each author by aggregating the advance and total royalties of each title

In [34]:
%%sql
select Author_ID,
       round(sum(subquery.Royalty+subquery.Advance),2) as 'Total_Profits'
      
from (select t.title_id as 'Title_ID',
             t.title as 'Title',
             a.au_id as 'Author_ID',
             t.price * s.qty * t.royalty / 100 * ta.royaltyper / 100 as 'Royalty',
             t.advance as 'Advance'            
      
    from authors as a join titleauthor as ta on a.au_id = ta.au_id
                      join titles as t on ta.title_id = t.title_id
                      join sales as s on s.title_id = t.title_id
    ) as subquery

group by Author_ID
order by Total_Profits desc
limit 3

 * sqlite:///../../20-lab-sql-select/publications.db
Done.

[('899-46-2035', 39178.13),
 ('722-51-5454', 30021.53),
 ('213-46-8915', 20162.11)]

## Challenge 2

Create a table named most_profiting_authors to hold the data about the most profiting authors. The table should have 2 columns:

- au_id - Author ID
- profits - The profits of the author aggregating the advances and royalties

In [37]:
%%sql
create table most_profiting_authors as

select Author_ID,
       round(sum(subquery.Royalty+subquery.Advance),2) as 'Profits'
      
from (select t.title_id as 'Title_ID',
             t.title as 'Title',
             a.au_id as 'Author_ID',
             t.price * s.qty * t.royalty / 100 * ta.royaltyper / 100 as 'Royalty',
             t.advance as 'Advance'            
      
    from authors as a join titleauthor as ta on a.au_id = ta.au_id
                      join titles as t on ta.title_id = t.title_id
                      join sales as s on s.title_id = t.title_id
    ) as subquery

group by Author_ID
order by Profits desc

 * sqlite:///../../20-lab-sql-select/publications.db
Done.

[]

In [38]:
%%sql
select *
from most_profiting_authors

 * sqlite:///../../20-lab-sql-select/publications.db
Done.

[('899-46-2035', 39178.13),
 ('722-51-5454', 30021.53),
 ('213-46-8915', 20162.11),
 ('998-72-3567', 15187.96),
 ('267-41-2394', 13020.94),
 ('724-80-9391', 12028.72),
 ('409-56-7008', 10017.99),
 ('427-17-2319', 8050.0),
 ('846-92-7186', 8050.0),
 ('672-71-3249', 8011.99),
 ('472-27-2349', 8008.99),
 ('238-95-7766', 7110.16),
 ('807-91-6654', 7083.8),
 ('756-30-7391', 7032.39),
 ('274-80-9391', 5029.99),
 ('648-92-1872', 4033.46),
 ('486-29-1786', 4019.98),
 ('172-32-1176', 2029.99),
 ('712-45-1867', 23.99)]